olliw42/stm32ll-lib/src/stdstm32-uart.h
  #if defined STM32F1 || defined STM32F3 || defined STM32G4 || defined STM32WL
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32H5
    // H56x has UART8, but none of its pins is bonded up to LQFP64
    #if defined STM32H5_H56x
      #error UART8 has no pins bonded on STM32H56x packages up to LQFP64 !
    #else
      #error UART8 NOT AVAILABLE on STM32H503 !
    #endif
  #endif

#elif defined UART_USE_LPUART1 || defined UART_USE_LPUART1_PA2PA3 || defined UART_USE_LPUART1_PC1PC0 || \
      defined UART_USE_LPUART1_PA9PA10 || defined UART_USE_LPUART1_PB6PB7
  #define UART_UARTx             LPUART1
  #ifdef UART_USE_LPUART1
    // user needs to specify UART_USE_TX_IO, UART_USE_RX_IO, and possibly UART_USE_IO_AF
  #elif defined UART_USE_LPUART1_PA2PA3
    #define UART_TX_IO           IO_PA2
    #define UART_RX_IO           IO_PA3
    #ifdef STM32G4
      #define UART_IO_AF         IO_AF_12 // G4
    #elif defined STM32H5_H56x
      // H56x has no LPUART1 on PA2/PA3, caught further below
    #elif defined STM32H5
      // H503 has a silicon swap here: PA2=LPUART1_RX, PA3=LPUART1_TX (AF3).
      #undef UART_TX_IO
      #undef UART_RX_IO
      #define UART_TX_IO         IO_PA3
      #define UART_RX_IO         IO_PA2
      #define UART_IO_AF         IO_AF_3
    #else
      #define UART_IO_AF         IO_AF_8 // WL
    #endif
  #elif defined UART_USE_LPUART1_PC1PC0 // was LPUART1_REMAPPED
    #define UART_TX_IO           IO_PC1
    #define UART_RX_IO           IO_PC0
    #define UART_IO_AF           IO_AF_8
  #elif defined UART_USE_LPUART1_PA9PA10 // only H5, not swapped
    #define UART_TX_IO           IO_PA9
    #define UART_RX_IO           IO_PA10
    #define UART_IO_AF           IO_AF_3
  #elif defined UART_USE_LPUART1_PB6PB7 // only H5, not swapped
    #define UART_TX_IO           IO_PB6
    #define UART_RX_IO           IO_PB7
    #define UART_IO_AF           IO_AF_8
  #endif
  #if defined UART_USE_LPUART1_PA2PA3 && defined STM32H5_H56x
    // no pins were assigned above
    #error UART_USE_LPUART1_PA2PA3 not available on STM32H56x ! use UART_USE_LPUART1_PA9PA10 or UART_USE_LPUART1_PB6PB7
  #endif
  #define UART_IRQn              LPUART1_IRQn
  #define UART_IRQHandler        LPUART1_IRQHandler

  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error LPUART1 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #elif defined STM32WL
  #elif defined STM32H5
    #if defined UART_USE_LPUART1_PC1PC0
      #if defined STM32H5_H56x
        // PC0/PC1 are bonded on LQFP64, but carry SAI2, not LPUART1
        #error UART_USE_LPUART1_PC1PC0 not available on STM32H56x, PC0/PC1 are not LPUART1 pins ! use UART_USE_LPUART1_PA9PA10 or UART_USE_LPUART1_PB6PB7
      #else
        #error UART_USE_LPUART1_PC1PC0 not available on STM32H503 LQFP48, port C is not bonded !
      #endif
    #endif
  #endif

#else
  #error No UART_USE_UARTx defined!
#endif


// LPUART1 uses the LL_LPUART_xxx API instead of LL_USART_xxx, so several blocks below
// have to know which one was selected. define it once here rather than repeating the
// list of LPUART1 mappings at every use.
#if defined UART_USE_LPUART1 || defined UART_USE_LPUART1_PA2PA3 || defined UART_USE_LPUART1_PC1PC0 || \
    defined UART_USE_LPUART1_PA9PA10 || defined UART_USE_LPUART1_PB6PB7
  #define UART_IS_LPUART
#endif


// allows us to overwrite the default pin assignment
#ifdef UART_USE_TX_IO
  #undef UART_TX_IO
  #define UART_TX_IO             UART_USE_TX_IO
#endif
#ifdef UART_USE_RX_IO
  #undef UART_RX_IO
  #define UART_RX_IO             UART_USE_RX_IO
#endif
#ifdef UART_USE_IO_AF
  #undef UART_IO_AF
  #define UART_IO_AF             UART_USE_IO_AF
#endif


// catch missing defines, compiler will throw error anyhow, but so it is nicer
#if defined UART_USE_TX && !defined UART_TX_IO
  #error No UART TX IO defined!
#endif
#if defined UART_USE_RX && !defined UART_RX_IO
  #error No UART RX IO defined!
#endif
#if !defined UART_IO_AF
  #error No UART IO AF defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UART_IS_LPUART
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL || defined STM32H5
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL || defined STM32H5
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UART_USE_RX || defined UART_USE_TX_ISR

void UART_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UART_UARTx, REG_SR); // read USART_SR register

#ifdef UART_USE_RX
  if ((usart_sr & FLAG_SR_RXNE) && LL_USART_IsEnabledIT_RXNE(UART_UARTx)) {
#ifdef UART_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uart_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uart_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uart_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UART_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UART_RX_CALLBACK_FULL
    UART_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uart_rxwritepos + 1) & UART_RXBUFSIZEMASK;
    if (uart_rxreadpos != next) { // fifo not full
      uart_rxbuf[next] = usart_dr;
      uart_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UART_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#else
  // F3: ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  // F7: these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UART_UARTx, ICR, FLAGS_ICR);
#endif
#endif

#ifdef UART_USE_TX_ISR
  if ((usart_sr & FLAG_SR_TXE) && LL_USART_IsEnabledIT_TXE(UART_UARTx)) {
    if (uart_txwritepos != uart_txreadpos) { // fifo not empty
      uart_txreadpos = (uart_txreadpos + 1) & UART_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UART_UARTx, uart_txbuf[uart_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UART_UARTx); // disable interrupt when empty
#ifdef UART_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UART_UARTx); // enable TC interrupt
      LL_USART_EnableIT_TC(UART_UARTx);
#endif
#ifdef UART_IDLE_CALLBACK
      LL_USART_ClearFlag_IDLE(UART_UARTx); // enable IDLE interrupt
      LL_USART_EnableIT_IDLE(UART_UARTx);
#endif
    }
  }

#ifdef UART_TC_CALLBACK
  if ((usart_sr & FLAG_SR_TC) && LL_USART_IsEnabledIT_TC(UART_UARTx)) {
    LL_USART_DisableIT_TC(UART_UARTx);
    LL_USART_ClearFlag_TC(UART_UARTx);
    UART_TC_CALLBACK();
  }
#endif
#ifdef UART_IDLE_CALLBACK
  if ((usart_sr & FLAG_SR_IDLE) && LL_USART_IsEnabledIT_IDLE(UART_UARTx)) {
    LL_USART_DisableIT_IDLE(UART_UARTx);
    LL_USART_ClearFlag_IDLE(UART_UARTx);
    UART_IDLE_CALLBACK();
  }
#endif
#endif
}

